tiborsimon/embedded-tdd-headers/pic/8bit/pic18f6585_tdd.h
#define B3D62                         1649
#define B3D63                         1650
#define B3D64                         1651
#define B3D65                         1652
#define B3D66                         1653
#define B3D67                         1654
#define B3D7                          1655
#define B3D70                         1656
#define B3D71                         1657
#define B3D72                         1658
#define B3D73                         1659
#define B3D74                         1660
#define B3D75                         1661
#define B3D76                         1662
#define B3D77                         1663
#define CANSTAT_RO6                   1664
#define CANSTAT_RO6_EICODE0           1665
#define CANSTAT_RO6_EICODE1_ICODE0    1666
#define CANSTAT_RO6_EICODE2_ICODE1    1667
#define CANSTAT_RO6_EICODE3_ICODE2    1668
#define CANSTAT_RO6_EICODE4           1669
#define CANSTAT_RO6_OPMODE0           1670
#define CANSTAT_RO6_OPMODE1           1671
#define CANSTAT_RO6_OPMODE2           1672
#define CANCON_RO6                    1673
#define CANCON_RO6_FP0                1674
#define CANCON_RO6_WIN0_FP1           1675
#define CANCON_RO6_WIN1_FP2           1676
#define CANCON_RO6_WIN2_FP3           1677
#define CANCON_RO6_ABAT               1678
#define CANCON_RO6_REQOP0             1679
#define CANCON_RO6_REQOP1             1680
#define CANCON_RO6_REQOP2             1681
#define B4CON                         1682
#define B4CON_TXPRI0                  1683
#define B4CON_FILHIT0_TXPRI0          1684
#define B4TXPRI0                      1685
#define B4CON_FILHIT0                 1686
#define B4FILHIT0                     1687
#define B4CON_FILHIT1                 1688
#define B4CON_TXPRI1                  1689
#define B4CON_FILHIT1_TXPRI1          1690
#define B4TXPRI1                      1691
#define B4FILHIT1                     1692
#define B4CON_RTREN                   1693
#define B4CON_FILHIT2                 1694
#define B4RTREN                       1695
#define B4FILHIT2                     1696
#define B4CON_FILHIT2_RTREN           1697
#define B4CON_TXREQ                   1698
#define B4TXREQ                       1699
#define B4CON_FILHIT3_TXREQ           1700
#define B4CON_FILHIT3                 1701
#define B4FILHIT3                     1702
#define B4CON_TXERR                   1703
#define B4CON_FILHIT4_TXERR           1704
#define B4TXERR                       1705
#define B4CON_FILHIT4                 1706
#define B4FILHIT4                     1707
#define B4CON_TXLARB                  1708
#define B4TXLARB                      1709
#define B4CON_RTRRO_TXLARB            1710
#define B4CON_RTRRO                   1711
#define B4RTRRO                       1712
#define B4TXABT                       1713
#define B4CON_RXM1_TXABT              1714
#define B4CON_RXM1                    1715
#define B4CON_TXABT                   1716
#define B4RXM1                        1717
#define B4CON_TXBIF                   1718
#define B4CON_RXFUL_TXBIF             1719
#define B4TXB3IF                      1720
#define B4RXFUL                       1721
#define B4CON_RXFUL                   1722
#define B4SIDH                        1723
#define B4SIDH_SID3                   1724
#define B4SID3                        1725
#define B4SID4                        1726
#define B4SIDH_SID4                   1727
#define B4SID5                        1728
#define B4SIDH_SID5                   1729
#define B4SIDH_SID6                   1730
#define B4SID6                        1731
#define B4SID7                        1732
#define B4SIDH_SID7                   1733
#define B4SID8                        1734
#define B4SIDH_SID8                   1735
#define B4SID9                        1736
#define B4SIDH_SID9                   1737
#define B4SIDH_SID10                  1738
#define B4SID10                       1739
#define B4SIDL                        1740
#define B4EID16                       1741
#define B4SIDL_EID16                  1742
#define B4EID17                       1743
#define B4SIDL_EID17                  1744
#define B4EXIDE                       1745
#define B4SIDL_EXID                   1746
#define B4SIDL_EXIDE                  1747
#define B4EXID                        1748
#define B4SIDL_SRR                    1749
#define B4SRR                         1750
#define B4SIDL_SID0                   1751
#define B4SID0                        1752
#define B4SIDL_SID1                   1753
#define B4SID1                        1754
#define B4SIDL_SID2                   1755
#define B4SID2                        1756
#define B4EIDH                        1757
#define B4EID8                        1758
#define B4EIDH_EID8                   1759
#define B4EID9                        1760
#define B4EIDH_EID9                   1761
#define B4EID10                       1762
#define B4EIDH_EID10                  1763
#define B4EID11                       1764
#define B4EIDH_EID11                  1765
#define B4EID12                       1766
#define B4EIDH_EID12                  1767
#define B4EID13                       1768
#define B4EIDH_EID13                  1769
#define B4EID14                       1770
#define B4EIDH_EID14                  1771
#define B4EID15                       1772
#define B4EIDH_EID15                  1773
#define B4EIDL                        1774
#define B4EID0                        1775
#define B4EIDL_EID0                   1776
#define B4EID1                        1777
#define B4EIDL_EID1                   1778
#define B4EID2                        1779
#define B4EIDL_EID2                   1780
#define B4EID3                        1781
#define B4EIDL_EID3                   1782
#define B4EID4                        1783
#define B4EIDL_EID4                   1784
#define B4EID5                        1785
#define B4EIDL_EID5                   1786
#define B4EID6                        1787
#define B4EIDL_EID6                   1788
#define B4EID7                        1789
#define B4EIDL_EID7                   1790
#define B4DLC                         1791
#define B4DLC_DLC0                    1792
#define B4DLC0                        1793
#define B4DLC_DLC1                    1794
#define B4DLC1                        1795
#define B4DLC_DLC2                    1796
#define B4DLC2                        1797
#define B4DLC_DLC3                    1798
#define B4DLC3                        1799
#define B4DLC_RESRB0                  1800
#define B4DLC_RB0                     1801
#define B4RB0                         1802
#define B4DLC_RESRB1                  1803
#define B4DLC_RB1                     1804
#define B4RB1                         1805
#define B4RXRTR                       1806
#define B4DLC_RXRTR                   1807
#define B4DLC_TXRTR                   1808
#define B4D0                          1809
#define B4D00                         1810
#define B4D01                         1811
#define B4D02                         1812
#define B4D03                         1813
#define B4D04                         1814
#define B4D05                         1815
#define B4D06                         1816
#define B4D07                         1817
#define B4D1                          1818
#define B4D10                         1819
#define B4D11                         1820
#define B4D12                         1821
#define B4D13                         1822
#define B4D14                         1823
#define B4D15                         1824
#define B4D16                         1825
#define B4D17                         1826
#define B4D2                          1827
#define B4D20                         1828
#define B4D21                         1829
#define B4D22                         1830
#define B4D23                         1831
#define B4D24                         1832
#define B4D25                         1833
#define B4D26                         1834
#define B4D27                         1835
#define B4D3                          1836
#define B4D30                         1837
#define B4D31                         1838
#define B4D32                         1839
#define B4D33                         1840
#define B4D34                         1841
#define B4D35                         1842
#define B4D36                         1843
#define B4D37                         1844
#define B4D4                          1845
#define B4D40                         1846
#define B4D41                         1847
#define B4D42                         1848
#define B4D43                         1849
#define B4D44                         1850
#define B4D45                         1851
#define B4D46                         1852
#define B4D47                         1853
#define B4D5                          1854
#define B4D50                         1855
#define B4D51                         1856
#define B4D52                         1857
#define B4D53                         1858
#define B4D54                         1859
#define B4D55                         1860
#define B4D56                         1861
#define B4D57                         1862
#define B4D6                          1863
#define B4D60                         1864
#define B4D61                         1865
#define B4D62                         1866
#define B4D63                         1867
#define B4D64                         1868
#define B4D65                         1869
#define B4D66                         1870
#define B4D67                         1871
#define B4D7                          1872
#define B4D70                         1873
#define B4D71                         1874
#define B4D72                         1875
#define B4D73                         1876
#define B4D74                         1877
#define B4D75                         1878
#define B4D76                         1879
#define B46D77                        1880
#define B4D77                         1881
#define CANSTAT_RO5                   1882
#define CANSTAT_RO5_EICODE0           1883
#define CANSTAT_RO5_EICODE1_ICODE0    1884
#define CANSTAT_RO5_EICODE2_ICODE1    1885
#define CANSTAT_RO5_EICODE3_ICODE2    1886
#define CANSTAT_RO5_EICODE4           1887
#define CANSTAT_RO5_OPMODE0           1888
#define CANSTAT_RO5_OPMODE1           1889
#define CANSTAT_RO5_OPMODE2           1890
#define CANCON_RO5                    1891
#define CANCON_RO5_FP0                1892
#define CANCON_RO5_WIN0_FP1           1893
#define CANCON_RO5_WIN1_FP2           1894
#define CANCON_RO5_WIN2_FP3           1895
#define CANCON_RO5_ABAT               1896
#define CANCON_RO5_REQOP0             1897
#define CANCON_RO5_REQOP1             1898
#define CANCON_RO5_REQOP2             1899
#define B5CON                         1900
#define B5CON_FILHIT0_TXPRI0          1901
#define B5FILHIT0                     1902
#define B5TXPRI0                      1903
#define B5CON_TXPRI0                  1904
#define B5CON_FILHIT0                 1905
#define B5CON_FILHIT1_TXPRI1          1906
#define B5FILHIT1                     1907
#define B5TXPRI1                      1908
#define B5CON_TXPRI1                  1909
#define B5CON_FILHIT1                 1910
#define B5CON_FILHIT2_RTREN           1911
#define B5CON_FILHIT2                 1912
#define B5FILHIT2                     1913
#define B5CON_RTREN                   1914
#define B5RTREN                       1915
#define B5TXREQ                       1916
#define B5CON_TXREQ                   1917
#define B5CON_FILHIT3_TXREQ           1918
#define B5FILHIT3                     1919
#define B5CON_FILHIT3                 1920
#define B5CON_TXERR                   1921
#define B5FILHIT4                     1922
#define B5CON_FILHIT4                 1923
#define B5TXERR                       1924
#define B5CON_FILHIT4_TXERR           1925
#define B5RTRRO                       1926
#define B5CON_TXLARB                  1927
#define B5TXLARB                      1928
#define B5CON_RTRRO_TXLARB            1929
#define B5CON_RTRRO                   1930
#define B5RXM1                        1931
#define B5CON_RXM1_TXABT              1932
#define B5TXABT                       1933
#define B5CON_RXM1                    1934
#define B5CON_TXABT                   1935
#define B5CON_RXFUL                   1936
#define B5CON_TXBIF                   1937
#define B5TXBIF                       1938
#define B5CON_RXFUL_TXBIF             1939
#define B5RXFUL                       1940
#define B5SIDH                        1941
#define B5SIDH_SID3                   1942
#define B5SID3                        1943
#define B5SIDH_SID4                   1944
#define B5SID4                        1945
#define B5SIDH_SID5                   1946
#define B5SID5                        1947
#define B5SIDH_SID6                   1948
#define B5SID6                        1949
#define B5SIDH_SID7                   1950
#define B5SID7                        1951
#define B5SIDH_SID8                   1952
#define B5SID8                        1953
#define B5SIDH_SID9                   1954
#define B5SID9                        1955
#define B5SID10                       1956
#define B5SIDH_SID10                  1957
#define B5SIDL                        1958
#define B5SIDL_EID16                  1959
#define B5EID16                       1960
#define B5SIDL_EID17                  1961
#define B5EID17                       1962
#define B5EXID                        1963
#define B5EXIDE                       1964
#define B5SIDL_EXIDE                  1965
#define B5SIDL_EXID                   1966
#define B5SIDL_SRR                    1967
#define B5SRR                         1968
#define B5SID0                        1969
#define B5SIDL_SID0                   1970
#define B5SID1                        1971
#define B5SIDL_SID1                   1972
#define B5SID2                        1973
#define B5SIDL_SID2                   1974
#define B5EIDH                        1975
#define B5EIDH_EID8                   1976
#define B5EID8                        1977
#define B5EIDH_EID9                   1978
#define B5EID9                        1979
#define B5EIDH_EID10                  1980
#define B5EID10                       1981
#define B5EIDH_EID11                  1982
#define B5EID11                       1983
#define B5EIDH_EID12                  1984
#define B5EID12                       1985
#define B5EIDH_EID13                  1986
#define B5EID13                       1987
#define B5EIDH_EID14                  1988
#define B5EID14                       1989
#define B5EIDH_EID15                  1990
#define B5EID15                       1991
#define B5EIDL                        1992
#define B5EID0                        1993
#define B5EIDL_EID0                   1994
#define B5EID1                        1995
#define B5EIDL_EID1                   1996
#define B5EID2                        1997
#define B5EIDL_EID2                   1998
#define B5EID3                        1999
#define B5EIDL_EID3                   2000
#define B5EID4                        2001
#define B5EIDL_EID4                   2002
#define B5EID5                        2003
#define B5EIDL_EID5                   2004
#define B5EID6                        2005
#define B5EIDL_EID6                   2006
#define B5EID7                        2007
#define B5EIDL_EID7                   2008
#define B5DLC                         2009
#define B5DLC0                        2010
#define B5DLC_DLC0                    2011
#define B5DLC1                        2012
#define B5DLC_DLC1                    2013
#define B5DLC2                        2014
#define B5DLC_DLC2                    2015
#define B5DLC3                        2016
#define B5DLC_DLC3                    2017
#define B5DLC_RESRB0                  2018
#define B5DLC_RB0                     2019
#define B5RB0                         2020
#define B5DLC_RESRB1                  2021
#define B5DLC_RB1                     2022
#define B5RB1                         2023
#define B5DLC_RXRTR                   2024
#define B5RXRTR                       2025
#define B5D0                          2026
#define B5D00                         2027
#define B5D01                         2028
#define B5D02                         2029
#define B5D03                         2030
#define B5D04                         2031
#define B5D05                         2032
#define B5D06                         2033
#define B5D07                         2034
#define B57D07                        2035
#define B5D1                          2036
#define B5D10                         2037
#define B5D11                         2038
#define B5D12                         2039
#define B5D13                         2040
#define B5D14                         2041
#define B5D15                         2042
#define B5D16                         2043
#define B5D17                         2044
#define B5D2                          2045
#define B5D20                         2046
#define B5D21                         2047
#define B5D22                         2048
#define B57D23                        2049
#define B5D23                         2050
#define B5D24                         2051
#define B5D25                         2052
#define B5D26                         2053
#define B5D27                         2054
#define B5D3                          2055
#define B5D30                         2056
#define B5D31                         2057
#define B5D32                         2058
#define B5D33                         2059
#define B5D34                         2060
#define B5D35                         2061
#define B5D36                         2062
#define B5D37                         2063
#define B5D4                          2064
#define B5D40                         2065
#define B5D41                         2066
#define B5D42                         2067
#define B5D43                         2068
#define B5D44                         2069
#define B5D45                         2070
#define B5D46                         2071
#define B5D47                         2072
#define B5D5                          2073
#define B5D50                         2074
#define B5D51                         2075
#define B5D52                         2076
#define B5D53                         2077
#define B5D54                         2078
#define B5D55                         2079
#define B5D56                         2080
#define B5D57                         2081
#define B5D6                          2082
#define B5D60                         2083
#define B5D61                         2084
#define B5D62                         2085
#define B5D63                         2086
#define B5D64                         2087
#define B5D65                         2088
#define B5D66                         2089
#define B5D67                         2090
#define B5D7                          2091
#define B5D70                         2092
#define B5D71                         2093
#define B5D72                         2094
#define B5D73                         2095
#define B5D74                         2096
#define B5D75                         2097
#define B5D76                         2098
#define B5D77                         2099
#define CANSTAT_RO4                   2100
#define CANSTAT_RO4_EICODE0           2101
#define CANSTAT_RO4_EICODE1_ICODE0    2102
#define CANSTAT_RO4_EICODE2_ICODE1    2103
#define CANSTAT_RO4_EICODE3_ICODE2    2104
#define CANSTAT_RO4_EICODE4           2105
#define CANSTAT_RO4_OPMODE0           2106
#define CANSTAT_RO4_OPMODE1           2107
#define CANSTAT_RO4_OPMODE2           2108
#define CANCON_RO4                    2109
#define CANCON_RO4_FP0                2110
#define CANCON_RO4_WIN0_FP1           2111
#define CANCON_RO4_WIN1_FP2           2112
#define CANCON_RO4_WIN2_FP3           2113
#define CANCON_RO4_ABAT               2114
#define CANCON_RO4_REQOP0             2115
#define CANCON_RO4_REQOP1             2116
#define CANCON_RO4_REQOP2             2117
#define RXF0SIDH                      2118
#define RXF0SID3                      2119
#define RXF0SIDH_SID3                 2120
#define RXF0SID4                      2121
#define RXF0SIDH_SID4                 2122
#define RXF0SID5                      2123
#define RXF0SIDH_SID5                 2124
#define RXF0SID6                      2125
#define RXF0SIDH_SID6                 2126
#define RXF0SID7                      2127
#define RXF0SIDH_SID7                 2128
#define RXF0SID8                      2129
#define RXF0SIDH_SID8                 2130
#define RXF0SID9                      2131
#define RXF0SIDH_SID9                 2132
#define RXF0SID10                     2133
#define RXF0SIDH_SID10                2134
#define RXF0SIDL                      2135
#define RXF0SIDL_EID16                2136
#define RXF0EID16                     2137
#define RXF0SIDL_EID17                2138
#define RXF0EID17                     2139
#define RXF0EXIDEN                    2140
#define RXF0SIDL_EXIDE                2141
#define RXF0SIDL_EXIDEN               2142
#define RXF0SID0                      2143
#define RXF0SIDL_SID0                 2144
#define RXF0SIDL_SID1                 2145
#define RXF0SID1                      2146
#define RXF0SID2                      2147
#define RXF0SIDL_SID2                 2148
#define RXF0EIDH                      2149
#define RXF0EIDH_EID8                 2150
#define RXF0EID8                      2151
#define RXF0EIDH_EID9                 2152
#define RXF0EID9                      2153
#define RXF0EIDH_EID10                2154
#define RXF0EID10                     2155
#define RXF0EIDH_EID11                2156
#define RXF0EID11                     2157
#define RXF0EIDH_EID12                2158
#define RXF0EID12                     2159
#define RXF0EIDH_EID13                2160
#define RXF0EID13                     2161
#define RXF0EIDH_EID14                2162
#define RXF0EID14                     2163
#define RXF0EIDH_EID15                2164
#define RXF0EID15                     2165
#define RXF0EIDL                      2166
#define RXF0EIDL_EID0                 2167
#define RXF0EID0                      2168
#define RXF0EIDL_EID1                 2169
#define RXF0EID1                      2170
#define RXF0EIDL_EID2                 2171
#define RXF0EID2                      2172
#define RXF0EIDL_EID3                 2173
#define RXF0EID3                      2174
#define RXF0EIDL_EID4                 2175
#define RXF0EID4                      2176
#define RXF0EIDL_EID5                 2177
#define RXF0EID5                      2178
#define RXF0EIDL_EID6                 2179
#define RXF0EID6                      2180
#define RXF0EIDL_EID7                 2181
#define RXF0EID7                      2182
#define RXF1SIDH                      2183
#define RXF1SID3                      2184
#define RXF1SIDH_SID3                 2185
#define RXF1SID4                      2186
#define RXF1SIDH_SID4                 2187
#define RXF1SID5                      2188
#define RXF1SIDH_SID5                 2189
#define RXF1SID6                      2190
#define RXF1SIDH_SID6                 2191
#define RXF1SID7                      2192
#define RXF1SIDH_SID7                 2193
#define RXF1SID8                      2194
#define RXF1SIDH_SID8                 2195
#define RXF1SID9                      2196
#define RXF1SIDH_SID9                 2197
#define RXF1SIDH_SID10                2198
#define RXF1SID10                     2199
#define RXF1SIDL                      2200
#define RXF1SIDL_EID16                2201
#define RXF1EID16                     2202
#define RXF1SIDL_EID17                2203
#define RXF1EID17                     2204
#define RXF1EXIDEN                    2205
#define RXF1SIDL_EXIDE                2206
